// src/mock-users.js
export const MOCK_USERS = {
  me: { // 현재 로그인한 사용자
    id: 'me',
    nickname: '나',
    timetable: {
      '월': [0, 1, 1, 0, 0, 1, 0, 0, 0, 0], // 0:불가능, 1:가능
      '화': [1, 1, 0, 0, 0, 0, 0, 0, 0, 0],
      '수': [0, 0, 0, 1, 1, 1, 0, 0, 0, 0],
      '목': [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
      '금': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    }
  },
  스터디홀릭: {
    id: '스터디홀릭',
    nickname: '스터디홀릭',
    timetable: {
      '월': [1, 1, 0, 0, 0, 0, 0, 0, 0, 0],
      '화': [0, 0, 1, 1, 1, 0, 0, 0, 0, 0],
      '수': [1, 1, 0, 0, 0, 0, 0, 0, 0, 0],
      '목': [0, 0, 0, 0, 0, 1, 1, 1, 0, 0],
      '금': [1, 1, 1, 0, 0, 0, 0, 0, 0, 0],
    }
  },
  경영새내기: {
    id: '경영새내기',
    nickname: '경영새내기',
    timetable: {
      '월': [0, 0, 0, 0, 1, 1, 1, 0, 0, 0],
      '화': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      '수': [1, 1, 1, 0, 0, 0, 0, 0, 0, 0],
      '목': [0, 0, 1, 1, 0, 0, 0, 0, 0, 0],
      '금': [0, 0, 0, 1, 1, 1, 0, 0, 0, 0],
    }
  },
  시간표_미제공자: { // E-1 테스트용
    id: '시간표_미제공자',
    nickname: '시간표_미제공자',
    timetable: null, // 시간표 정보가 없음
  }
};